[
    {
        "title": "",
        "body": "This is a good book, though it is so ridiculously overrated.\nThere are so many great books out there that will never get the attention they deserve. They will be forgotten and their wisdom heard by only a select few who are willing to go looking for it. So it annoys me when books like this are acclaimed by critics and readers alike as the best pieces of fiction in existence (when they are not.) There’s so much more out there!\n\nAnyway, rant over. The thing I like most about The Great Gatsby is the language, the subtlety’s and the suggestions, the things that are not directly said but are said nevertheless. It’s a true feat of writing and at times it reminded me of a stage piece. The dialogue does not give the answers, but it is the character’s actions and movements (so fantastically narrated) that give the game away: it reveals their internal worlds.\n\nAs such this is a book that can easily be skimmed over. The plot is basic and relatively unengaging and consequently I think an inattentive reader has a lot to miss here. It’s all about illusions and false appearances just like real life. The way people perceive us is not how we truly are and sometimes individuals actively work towards creating a desired appearance for the outside world. It’s easily done with enough time, effort and money. What Gatsby creates for the outside is a dream, an ideal life that looks perfect.\n\nHowever, scratch the surface and it is so very, very, clear that not everything is perfect. His supposed “happiness” is hollow and dictated by the whims of society. It is fickle, egotistical and driven by status and all the silly little symbols that go with it. His success is what society demands success to be; thus, he positions himself into a place where he can chase his true dream. In doing so Gatsby shows us that not everything is as simple as it appears, and that society driven by such monetary values is a dangerous thing because everybody is so detached from what really matters in life. (The object of his affections, for example.)\n\nI enjoyed The Great Gatsby though I certainly did not love it. Its popularity baffles me to a degree, I can think of books from the same era that deserve far more attention. Still, I enjoyed reading it and I’m glad I finally did so."
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    },
    {
        "title": "",
        "body": ""
    }
]