[
    {
        "body": "This is a good book, though it is so ridiculously overrated.\nThere are so many great books out there that will never get the attention they deserve. They will be forgotten and their wisdom heard by only a select few who are willing to go looking for it. So it annoys me when books like this are acclaimed by critics and readers alike as the best pieces of fiction in existence (when they are not.) There’s so much more out there!\n\nAnyway, rant over. The thing I like most about The Great Gatsby is the language, the subtlety’s and the suggestions, the things that are not directly said but are said nevertheless. It’s a true feat of writing and at times it reminded me of a stage piece. The dialogue does not give the answers, but it is the character’s actions and movements (so fantastically narrated) that give the game away: it reveals their internal worlds.\n\nAs such this is a book that can easily be skimmed over. The plot is basic and relatively unengaging and consequently I think an inattentive reader has a lot to miss here. It’s all about illusions and false appearances just like real life. The way people perceive us is not how we truly are and sometimes individuals actively work towards creating a desired appearance for the outside world. It’s easily done with enough time, effort and money. What Gatsby creates for the outside is a dream, an ideal life that looks perfect.\n\nHowever, scratch the surface and it is so very, very, clear that not everything is perfect. His supposed “happiness” is hollow and dictated by the whims of society. It is fickle, egotistical and driven by status and all the silly little symbols that go with it. His success is what society demands success to be; thus, he positions himself into a place where he can chase his true dream. In doing so Gatsby shows us that not everything is as simple as it appears, and that society driven by such monetary values is a dangerous thing because everybody is so detached from what really matters in life. (The object of his affections, for example.)\n\nI enjoyed The Great Gatsby though I certainly did not love it. Its popularity baffles me to a degree, I can think of books from the same era that deserve far more attention. Still, I enjoyed reading it and I’m glad I finally did so."
    },
    {
        "body": "Why is it when I pick up To Kill A Mockingbird , I am instantly visited by a sensory memory: I’m walking home, leaves litter the ground, crunching under my feet. I smell the smoke of fireplaces and think about hot cider and the wind catches and my breath is taken from me and I bundle my coat tighter against me and lift my head to the sky, no clouds, just a stunning blue that hurts my eyes, another deep breath and I have this feeling that all is okay.\n\nWhy? Why this memory? I mean, this takes place in Alabama and mostly in the summer, well there is that one climatic scene on Halloween, but I bet it’s still hot enough to melt the balls off a brass monkey.\n \nIt must be the school thing, my daughter just finished reading it, prompting me to give it another go, to fall back into Scout’s world and pretend to be eight and let life simply be.\n\nHow is that? How can life for Scout be simple? I mean, she lives in the south, during the depression, she has to deal with ignorant schoolteachers and town folk, her ideas of what is right, what is what it should be are laughed at by her schoolmates… man, and I thought my childhood was rough.\n \nStill, she lives in this idyllic town, I mean, except for the racism and the creepy neighbors and the whole fact that it’s, you know, the south…(forgive me… I’m not immune to the downfalls of the north, I mean, we had witches and well, Ted Bundy was born here…) But, there’s this sense of childlike innocence to this book that makes me believe in humanity… even in the throes of evil. What am I saying here? I guess, that this is a good pick me up.\n \nWhat I also get from this book is that I have severe Daddy issues. I consume Atticus Finch in unnatural ways. He is the ultimate father; he has the perfect response for every situation. He is the transcendent character. My heart melts at each sentence devoted to him and I just about crumble during the courtroom scene.\n \nAm I gushing? I sure am. I was raised by a man who thought that Budweiser can artwork was the epitome of culture. That drinking a 6-pack was the breakfast of champions. That college was for sissies. He could throw out a racial slur without a single thought, care or worry to who was around. I won't even get into the debates/rantings of a 16 yr old me vs a 42 yr old him... What a role model.\n \nSo, I thank Harper Lee for giving me Atticus. I can cuddle up with my cider and pretend that I’m basking in his light. I can write this blurb that makes sense to maybe a handful but that is okay, I am approved of and all is good."
    },
    {
        "body": "Kids are evil. Don't you know?\n\nI've just finished rereading this book for my book club but, to be honest, I've liked it ever since my class were made to read it in high school. Overall, Lord of the Flies doesn't seem to be very popular, but I've always liked the almost Hobbesian look at the state of nature and how humanity behaves when left alone without societal rules and structures. Make the characters all angel-faced kids with sadistic sides to their personality and what do you have? Just your average high school drama, but set on a desert island. With a bit more bloody murder. But not that much more.\n \nIn 1954, when this book was published, Britain was in the process of being forced to face some harsh realities that it had blissfully chosen to ignore beforehand - that it is not, in fact, the centre of the universe, and the British Empire was not a thing of national pride, but an embarrassing infringement on the freedom and rights of other human beings. Much of British colonialism had been justified as a self-righteous mission to educate and modernise foreign 'savages'. So when put into its historical context, alongside the decolonisation movements, this book could be said to be an interesting deconstruction of white, Western supremacy.\n\nOf course, to a modern reader there's a lot of racism in this book. The racial aspect is a big factor. Golding establishes from the very first page that Ralph is a perfect white, blonde-haired, blue-eyed, private school boy. And Piggy even asks 'Which is better - to be a pack of painted n*****s like you are or to be sensible like Ralph is?' I'm not going to argue with anyone's interpretation, but I think there is actually room to see this book as a criticism of racism. For me, I always saw it as Golding challenging the notion of savages being dark-skinned, uneducated people from rural areas. With this book, he says screw that, I'll show you savages! and proceeds to show us how these private school silver spoon little jewels of the empire are no better for their fancy education and gold-plated upbringing.\n\nI think that seemed especially clear from the ending when the officer says 'I should have thought that a pack of British boys - you're all British, aren't you? - would have been able to put up a better show than that.'' Golding's way of saying that human nature is universal and no one can escape it.\n\nSome readers say that you have to have quite a negative view of human nature already to appreciate this book, but I don't think that's true. I'm not sure I necessarily agree with all the implications running around in the novel - namely, the failure of democracy and the pro-authority stance - but it serves as an interesting look at the dark side of human nature and how no one is beyond its reach. Plus, anyone who had a bit of a rough time in high school will probably not find the events in this book a huge \n\nThe fascinating thing about Lord of the Flies is the way many historical parallels can be drawn from the messages it carries. You could choose to view the charismatic and manipulative Jack Merridew as a kind of Hitler (or other dictator) who takes advantage of a group of people at their weakest. Dictators and radicals often find it easy to slip in when a society is in chaos... we do not have to assume that Golding believed that everyone everywhere is evil, only that we all have the capacity for it when we find ourselves in unstable situations.\n\nStill a fascinating book after all these years."
    },
    {
        "body": "I needed a quick read because I stupidly forgot that the library would be closed yesterday for Veteran's Day. I'd exhausted my current supply, and I needed a short term fix to hold me until I could get some new product today. So I grabbed Of Mice and Men off the bookshelf last night.\n\nAnd I'm glad I did because I'd somehow remembered that this was a depressing book. How wrong I was! Oh, sure there were some tense moments like when you think Lennie will accidently hurt Curley's wife in the barn. What a relief when George and Candy come in at the last minute and stop anything bad from happening! And isn't it nice that the scare changes both Curley and his wife so that they have a much better marriage and new appreciation for each other.\n\nPlus, it leads to the great moment when Curley is so grateful that he fronts George, Lennie and Candy the money to finally buy the ranch of their dreams. Oh, and that last scene with George and Candy on the porch of their new home while Lennie tends the rabbits brought a tear to my eye.\n\nWhat's that you say? I got the ending wrong? No, I'm quite certain this is what happened. No! Be quiet! I can't hear you! LA LA LA LA LA LA LA LA LA"
    },
    {
        "body": "Funnily enough, i read this book as a child and thought that it really WAS about animals. I remember thinking, Evil Pigs, I'm glad you're bacon in MY world, and Poor Hardworking Horsies, come live on my farm instead. You can have all the hay and makopa you want (sadly, no apples, tropical climate).\n \nI reread it after education spoiled my natural inclinations for fast and absolute punishment of evildoers and eternal rewards for the good. I do find it pleasantly strange that these animals are symbols for political stereotypes and yet people still appear in the book. Isn't that CRAZY? That's literary perversion in a class all its own.\n \nI'm thankful i read this in my formative years, before I had all this intellectual baggage (emphasis on baggage, piano on the intellect), because I got to appreciate it like a child would, almost like the way I appreciated Charlotte's Web. To me, back then, it was just another story about animals, albeit a wordy one, with no pictures.\n \nWhich is probably why I still experience a certain righteous thrill when eating crispy bacon."
    },
    {
        "body": "Quite possibly one of my favourite books!It was this novel that ignited my love for Greek and Roman mythology and antiquity - leading me to choose a degree in Classical Civilisations. \n \nI always look back on The Odyssey with fondness - I love all the monsters he faces and the gods who involve themselves with Odysseus' trials as he makes his way home after the Trojan War. LOVE LOVE LOVE. "
    },
    {
        "body": "I about made up my mind to pray; and see if I couldn't try to quit being the kind of boy I was, and be better. So I kneeled down. But the words wouldn't come. Why wouldn't they? It warn't no use to try and hide it from Him. Nor from me, neither. I knowed very well why they wouldn't come. It was because my heart wasn't right; it was because I warn't square; it was because I was playing double. I was letting on to give up sin, but away inside of me I was holding on to the biggest one of all. I was trying to make my mouth say I would do the right thing and the clean thing, and go and write to [Jim's:] owner and tell where he was; but deep down in me I knowed it was a lie--and He knowed it. You can't pray a lie -- I found that out...\n\n...It was a close place. I took it up, and held it in my hand. I was a trembling, because I'd got to decide, forever, betwixt two things, and I knowed it. I studied a minute, sort of holding my breath, and then says to myself: 'All right, then, I'll go to Hell'--and tore it up."
    },
    {
        "body": "80% of this book is just Victor Frankenstein falling into months-long fevers at the slightest inconvenience and also being a colossal piece of shit. The Creature, on the other hand, is the poster-monster for anyone who’s ever felt Othered and I simply LOVE HIM."
    },
    {
        "body": "Aldous Huxley wrote Brave New World in 1932. That's almost eighty years ago, but the book reads like it could have been written yesterday. (especially interesting to me was how Huxley was able to predict the future of both genetic engineering and the action blockbuster. Damn.)\n\nI think I liked this one better than 1984, the book traditionally considered to be this one's counterpart. Not really sure why this is, but it's probably because this one has a clearer outsider character (the Savage) who can view the world Huxley created through his separate perspective.\n\nIn this light, I will give the last word to Neil Postman, who discussed the differences between Orwell and Huxley's views of the future:\n\n What Orwell feared were those who would ban books. What Huxley feared was that there would be no reason to ban a book, for there would be no one who wanted to read one.\n\nOrwell feared those who would deprive us information. Huxley feared those who would give us so much that we would be reduced to passivity and egoism. Orwell feared that the truth would be concealed from us. Huxley feared the truth would be drowned in a sea of irrelevance. Orwell feared we would become a captive culture. Huxley feared we would become a trivial culture, preoccupied with some equivalte will ruin us. Huxley feared that what we love will ruin us."
    },
    {
        "body": "The Brontes fuelled my love for reading and convinced me that the classics weren't all mean, nasty books that fascist teachers made you read in school just to torture you. I grew up with Austen and Dickens, whom I loved, but the Brontes always seemed to come out on top for some reason. Jane Eyre is my second favourite after Wuthering Heights. I love the darkness and sadness of their novels, but the more... quiet style than you'd find in Dickens's wild tales of orphans, drunks and epic family betrayals. "
    }
]